Revit 2024 API
PipeSettings.ConnectorSeparator Property
 The connector separator string.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public string ConnectorSeparator { get; set; }
Visual Basic
Public Property ConnectorSeparator As String
	Get
	Set
Visual C++
public:
property String^ ConnectorSeparator {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
PipeSettings Class
Autodesk.Revit.DB.Plumbing Namespace